---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCExtrusionData.AddLoop(Autodesk.Revit.DB.CurveLoop)
source: html/8159ec21-ee77-91c7-1fbd-c974081fb995.htm
---
# Autodesk.Revit.DB.IFC.IFCExtrusionData.AddLoop Method

Adds a curve loop to the extrusion data.

## Syntax (C#)
```csharp
public void AddLoop(
	CurveLoop pLoop
)
```

## Parameters
- **pLoop** (`Autodesk.Revit.DB.CurveLoop`) - The curve loop.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null